VirtualKeyboard.addLayoutList(
{code:'MN'
,name:'Mongolian Cyrillic'
,normal:'=№-"₮:._,%?ещ\\фцужэнгшүзкъйыбөахролдпячёсмитьвю'
,shift:{0:'+1234567890',13:'|'}},
{code:'MNS'
,name:'Mongolian Script'
,normal:'᠍1234567890 =᠁ᠴᠣᠡᠷᠲᠶᠦᠢᠥᠫ〔〕ᠠᠰᠳᠹᠭᠬᠵᠺᠯ;᠋ᠽᠱᠼᠤᠪᠨᠮ᠂᠃.'
,shift:{0:'~!⁈⁉—%\u200c᠊\u200d()᠎+|',15:'ᠸᠧᠿ',24:'〈〉',31:'ᠾ',33:'ᠻᡀ᠄᠌ᡁ',39:'ᡂ',42:'ᠩ',44:'《》?'}
,caps:{13:'|',15:'ᠸᠧᠿ',24:'〈',31:'ᠾ',34:'ᡀ᠄᠌ᡁ',39:'ᡂ',42:'ᠩ',44:'《》?'}
,shift_caps:{13:'᠁',15:'ᠣᠡᠷ',24:'〔',31:'ᠬ',34:'ᠯ;᠋ᠽ',39:'ᠼ',42:'ᠨ',44:'᠂᠃.'}},
{code:'RU'
,name:'Russian'
,normal:'ё1234567890-=\\йцукенгшщзхъфывапролджэячсмитьбю.'
,shift:{1:'!"№;%:?*()_+/',46:','}},
{code:'EN-US'
,name:'US'
,normal:'`1234567890-=\\qwertyuiop[]asdfghjkl;\'zxcvbnm,./'
,shift:{0:'~!@#$%^&*()_+|',24:'{}',35:':"',44:'<>?'}}
);
